
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 11 to add, 33 to change, 56 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.POSTGRES_PASS
  * azurerm_key_vault_secret.POSTGRES_USER
  * azurerm_role_assignment.vmuser_login[0]
  * module.sa_storage_account.azurerm_role_assignment.storage-account-role-assignment[&#34;Storage Blob Data Contributor&#34;]
* Update
  * azurerm_automation_account.pre-aa
  * azurerm_data_protection_backup_vault.pre_backup_vault
  * azurerm_media_services_account.ams
  * azurerm_private_endpoint.ams_streamingendpoint_private_endpoint
  * azurerm_resource_group.rg_backup
  * module.data_gateway_vm[0].azurerm_managed_disk.managed_disks[&#34;datadisk1&#34;]
  * module.data_gateway_vm[0].azurerm_network_interface.vm_nic
  * module.data_gateway_vm[0].azurerm_virtual_machine_extension.vmextension[0]
  * module.data_gateway_vm[0].azurerm_windows_virtual_machine.winvm[0]
  * module.data_gateway_vm[1].azurerm_managed_disk.managed_disks[&#34;datadisk1&#34;]
  * module.data_gateway_vm[1].azurerm_network_interface.vm_nic
  * module.data_gateway_vm[1].azurerm_virtual_machine_extension.vmextension[0]
  * module.data_gateway_vm[1].azurerm_windows_virtual_machine.winvm[0]
  * module.data_store_db_v14.azurerm_postgresql_flexible_server.pgsql_server
  * module.edit_vm[0].azurerm_managed_disk.managed_disks[&#34;datadisk1&#34;]
  * module.edit_vm[0].azurerm_network_interface.vm_nic
  * module.finalsa_storage_account.azurerm_private_endpoint.this[0]
  * module.finalsa_storage_account.azurerm_storage_account.storage_account
  * module.finalsa_storage_account_backup.azurerm_storage_account.storage_account
  * module.ingestsa_storage_account.azurerm_private_endpoint.this[0]
  * module.ingestsa_storage_account.azurerm_storage_account.storage_account
  * module.ingestsa_storage_account_backup.azurerm_storage_account.storage_account
  * module.powerBI_data_gateway[0].azurerm_managed_disk.managed_disks[&#34;datadisk1&#34;]
  * module.powerBI_data_gateway[0].azurerm_network_interface.vm_nic
  * module.powerBI_data_gateway[0].azurerm_virtual_machine_extension.vmextension[0]
  * module.powerBI_data_gateway[0].azurerm_windows_virtual_machine.winvm[0]
  * module.powerBI_data_gateway[1].azurerm_managed_disk.managed_disks[&#34;datadisk1&#34;]
  * module.powerBI_data_gateway[1].azurerm_network_interface.vm_nic
  * module.powerBI_data_gateway[1].azurerm_virtual_machine_extension.vmextension[0]
  * module.powerBI_data_gateway[1].azurerm_windows_virtual_machine.winvm[0]
  * module.sa_storage_account.azurerm_private_endpoint.this[0]
  * module.sa_storage_account.azurerm_storage_account.storage_account
  * module.sa_storage_account_backup.azurerm_storage_account.storage_account
* Delete
  * azurerm_dev_test_global_vm_shutdown_schedule.powerbi_dg_vm[0]
  * azurerm_dev_test_global_vm_shutdown_schedule.powerbi_dg_vm[1]
  * azurerm_disk_encryption_set.pre-des
  * azurerm_key_vault_access_policy.dts_dts_pre_project_admin_access
  * azurerm_key_vault_access_policy.dts_pre_access
  * azurerm_key_vault_access_policy.power_app_access
  * azurerm_key_vault_access_policy.pre-des-disk
  * azurerm_key_vault_key.pre_kv_key
  * azurerm_key_vault_secret.dtgtwy_password_secret[0]
  * azurerm_key_vault_secret.dtgtwy_password_secret[1]
  * azurerm_key_vault_secret.dtgtwy_username_secret[0]
  * azurerm_key_vault_secret.dtgtwy_username_secret[1]
  * azurerm_key_vault_secret.vm_username_secret[0]
  * azurerm_managed_disk.dtgtwaydatadisk[0]
  * azurerm_managed_disk.dtgtwaydatadisk[1]
  * azurerm_managed_disk.vmdatadisk[0]
  * azurerm_monitor_diagnostic_setting.nic[0]
  * azurerm_network_interface.dtgwnic[0]
  * azurerm_network_interface.dtgwnic[1]
  * azurerm_network_interface.nic[0]
  * azurerm_role_assignment.powerapp_appreg
  * azurerm_role_assignment.vmuser_login[&#34;3fdd1d36-76b0-4048-8a7a-81395e23ca65&#34;]
  * azurerm_virtual_machine_data_disk_attachment.dtgtwy[0]
  * azurerm_virtual_machine_data_disk_attachment.dtgtwy[1]
  * azurerm_virtual_machine_data_disk_attachment.vmdatadisk[0]
  * azurerm_virtual_machine_extension.daa-agent[0]
  * azurerm_virtual_machine_extension.dtgtwayvmextension[0]
  * azurerm_virtual_machine_extension.dtgtwayvmextension[1]
  * azurerm_virtual_machine_extension.dtgtwydaa-agent[0]
  * azurerm_virtual_machine_extension.dtgtwydaa-agent[1]
  * azurerm_virtual_machine_extension.dtgtwymonitor-agent[0]
  * azurerm_virtual_machine_extension.dtgtwymonitor-agent[1]
  * azurerm_virtual_machine_extension.monitor-agent[0]
  * azurerm_virtual_machine_extension.msmonitor-agent[0]
  * azurerm_virtual_machine_extension.vm_aad[0]
  * azurerm_virtual_machine_extension.vmextension[0]
  * azurerm_windows_virtual_machine.dtgtwyvm[0]
  * azurerm_windows_virtual_machine.dtgtwyvm[1]
  * azurerm_windows_virtual_machine.vm[0]
  * null_resource.Encryption
  * random_password.dtgtwy_password[0]
  * random_password.dtgtwy_password[1]
  * random_string.dtgtwy_username[0]
  * random_string.dtgtwy_username[1]
  * random_string.edit_username[0]
  * module.dynatrace-oneagent[0].azurerm_virtual_machine_extension.dynatrace-oneagent[0]
  * module.dynatrace-oneagent-dtgtway[0].azurerm_virtual_machine_extension.dynatrace-oneagent[0]
  * module.dynatrace-oneagent-dtgtway[1].azurerm_virtual_machine_extension.dynatrace-oneagent[0]
  * module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds
* Replace
  * azurerm_key_vault_secret.edit_password[0]
  * azurerm_key_vault_secret.edit_username[0]
  * azurerm_virtual_machine_extension.aad[0]
  * azurerm_virtual_machine_extension.edit_init[0]
  * module.edit_vm[0].azurerm_virtual_machine_data_disk_attachment.data_disk_attachments[&#34;datadisk1&#34;]
  * module.edit_vm[0].azurerm_virtual_machine_extension.vmextension[0]
  * module.edit_vm[0].azurerm_windows_virtual_machine.winvm[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_automation_account.pre-aa will be updated in-place
  ~ resource "azurerm_automation_account" "pre-aa" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Automation/automationAccounts/pre-stg-aa"
        name                          = "pre-stg-aa"
      ~ tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_data_protection_backup_vault.pre_backup_vault will be updated in-place
  ~ resource "azurerm_data_protection_backup_vault" "pre_backup_vault" {
        id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.DataProtection/backupVaults/pre-backup-vault-stg"
        name                = "pre-backup-vault-stg"
      ~ tags                = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_dev_test_global_vm_shutdown_schedule.powerbi_dg_vm[0] will be destroyed
  # (because azurerm_dev_test_global_vm_shutdown_schedule.powerbi_dg_vm is not in configuration)
  - resource "azurerm_dev_test_global_vm_shutdown_schedule" "powerbi_dg_vm" {
      - daily_recurrence_time = "1800" -> null
      - enabled               = false -> null
      - id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.DevTestLab/schedules/shutdown-computevm-powerbi-1-stg" -> null
      - location              = "uksouth" -> null
      - tags                  = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "application"         = "pre-recorded-evidence"
          - "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          - "environment"         = "staging"
          - "managedBy"           = "Pre Recorded Evidence"
        } -> null
      - timezone              = "GMT Standard Time" -> null
      - virtual_machine_id    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/powerbi-1-stg" -> null

      - notification_settings {
          - enabled         = false -> null
          - time_in_minutes = 30 -> null
        }
    }

  # azurerm_dev_test_global_vm_shutdown_schedule.powerbi_dg_vm[1] will be destroyed
  # (because azurerm_dev_test_global_vm_shutdown_schedule.powerbi_dg_vm is not in configuration)
  - resource "azurerm_dev_test_global_vm_shutdown_schedule" "powerbi_dg_vm" {
      - daily_recurrence_time = "1800" -> null
      - enabled               = false -> null
      - id                    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.DevTestLab/schedules/shutdown-computevm-powerbi-2-stg" -> null
      - location              = "uksouth" -> null
      - tags                  = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "application"         = "pre-recorded-evidence"
          - "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          - "environment"         = "staging"
          - "managedBy"           = "Pre Recorded Evidence"
        } -> null
      - timezone              = "GMT Standard Time" -> null
      - virtual_machine_id    = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/powerbi-2-stg" -> null

      - notification_settings {
          - enabled         = false -> null
          - time_in_minutes = 30 -> null
        }
    }

  # azurerm_disk_encryption_set.pre-des will be destroyed
  # (because azurerm_disk_encryption_set.pre-des is not in configuration)
  - resource "azurerm_disk_encryption_set" "pre-des" {
      - auto_key_rotation_enabled = false -> null
      - encryption_type           = "EncryptionAtRestWithCustomerKey" -> null
      - id                        = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/diskEncryptionSets/pre-des" -> null
      - key_vault_key_id          = "https://pre-stg.vault.azure.net/keys/pre-des-key/cc95064bcd274ef28cb3ee50667fc1b2" -> null
      - location                  = "uksouth" -> null
      - name                      = "pre-des" -> null
      - resource_group_name       = "pre-stg" -> null
      - tags                      = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "application"         = "pre-recorded-evidence"
          - "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#dts-pre-rec-evidence-tech"
          - "environment"         = "staging"
          - "managedBy"           = "Pre Recorded Evidence"
        } -> null

      - identity {
          - identity_ids = [] -> null
          - principal_id = "55a662b1-fd53-4655-a7fd-b5378150ddd3" -> null
          - tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
          - type         = "SystemAssigned" -> null
        }
    }

  # azurerm_key_vault_access_policy.dts_dts_pre_project_admin_access will be destroyed
  # (because azurerm_key_vault_access_policy.dts_dts_pre_project_admin_access is not in configuration)
  - resource "azurerm_key_vault_access_policy" "dts_dts_pre_project_admin_access" {
      - certificate_permissions = [
          - "List",
          - "Get",
          - "GetIssuers",
          - "ListIssuers",
        ] -> null
      - id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/objectId/56a29187-3d5f-4262-99d6-c635776e0eac" -> null
      - key_permissions         = [
          - "List",
          - "Get",
        ] -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> null
      - object_id               = "56a29187-3d5f-4262-99d6-c635776e0eac" -> null
      - secret_permissions      = [
          - "List",
          - "Get",
        ] -> null
      - storage_permissions     = [
          - "List",
          - "Get",
        ] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # azurerm_key_vault_access_policy.dts_pre_access will be destroyed
  # (because azurerm_key_vault_access_policy.dts_pre_access is not in configuration)
  - resource "azurerm_key_vault_access_policy" "dts_pre_access" {
      - certificate_permissions = [
          - "List",
          - "Update",
          - "Create",
          - "Import",
          - "Delete",
          - "ManageContacts",
          - "ManageIssuers",
          - "GetIssuers",
          - "ListIssuers",
          - "SetIssuers",
          - "DeleteIssuers",
          - "Recover",
        ] -> null
      - id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/objectId/b1fd4154-355f-4683-a795-d09cdb814d16" -> null
      - key_permissions         = [
          - "List",
          - "Update",
          - "Create",
          - "Import",
          - "Delete",
          - "Recover",
        ] -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> null
      - object_id               = "b1fd4154-355f-4683-a795-d09cdb814d16" -> null
      - secret_permissions      = [
          - "List",
          - "Set",
          - "Delete",
          - "Recover",
        ] -> null
      - storage_permissions     = [] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # azurerm_key_vault_access_policy.power_app_access will be destroyed
  # (because azurerm_key_vault_access_policy.power_app_access is not in configuration)
  - resource "azurerm_key_vault_access_policy" "power_app_access" {
      - certificate_permissions = [
          - "List",
          - "Update",
          - "Create",
          - "Import",
          - "Delete",
          - "ManageContacts",
          - "ManageIssuers",
          - "GetIssuers",
          - "ListIssuers",
          - "SetIssuers",
          - "DeleteIssuers",
        ] -> null
      - id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/objectId/2757c27a-aa98-4cdf-9aaa-90cf47d0656c" -> null
      - key_permissions         = [
          - "List",
          - "Update",
          - "Create",
          - "Import",
          - "Delete",
          - "Get",
        ] -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> null
      - object_id               = "2757c27a-aa98-4cdf-9aaa-90cf47d0656c" -> null
      - secret_permissions      = [
          - "List",
          - "Set",
          - "Delete",
          - "Get",
        ] -> null
      - storage_permissions     = [] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # azurerm_key_vault_access_policy.pre-des-disk will be destroyed
  # (because azurerm_key_vault_access_policy.pre-des-disk is not in configuration)
  - resource "azurerm_key_vault_access_policy" "pre-des-disk" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/objectId/55a662b1-fd53-4655-a7fd-b5378150ddd3" -> null
      - key_permissions         = [
          - "Get",
          - "WrapKey",
          - "UnwrapKey",
        ] -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> null
      - object_id               = "55a662b1-fd53-4655-a7fd-b5378150ddd3" -> null
      - secret_permissions      = [] -> null
      - storage_permissions     = [] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # azurerm_key_vault_key.pre_kv_key will be destroyed
  # (because azurerm_key_vault_key.pre_kv_key is not in configuration)
  - resource "azurerm_key_vault_key" "pre_kv_key" {
      - e                       = "AQAB" -> null
      - id                      = "https://pre-stg.vault.azure.net/keys/pre-des-key/cc95064bcd274ef28cb3ee50667fc1b2" -> null
      - key_opts                = [
          - "decrypt",
          - "encrypt",
          - "sign",
          - "unwrapKey",
          - "verify",
          - "wrapKey",
        ] -> null
      - key_size                = 2048 -> null
      - key_type                = "RSA" -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> null
      - n                       = "30h5tAeGPF4Zj-1j3RLhDT1I5wJpmU1E9VcLuXCCIGHImcj_22Vm3Xxn3ZkoyLmnzcDrDejV4DYG_u2Y6PSuWkLcOIH2_jmW-R6rhXvsyOwBbSW0i2dqMGc1dICjpbANXltFw0wpz_D0MooqLlV-aKefy0-NZ_smDOiGLGfNxm-uIL7CAIneNd1Mmqc1nL6D_XuZreuxooegPgAonerJr99mWmN_SbUK1052zM4wI7fUUn0hqN1UXRryxDhHmBdQjw3gtVgJPVqRL9vsq-sGoPUOtB7FX8gSC6jNCsdHXHM3iOhknA9jCVDUYO6c4wVgGnzxOvVl2GuO5ckE1AQFAQ" -> null
      - name                    = "pre-des-key" -> null
      - public_key_openssh      = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDfSHm0B4Y8XhmP7WPdEuENPUjnAmmZTUT1Vwu5cIIgYciZyP/bZWbdfGfdmSjIuafNwOsN6NXgNgb+7Zjo9K5aQtw4gfb+OZb5HquFe+zI7AFtJbSLZ2owZzV0gKOlsA1eW0XDTCnP8PQyiiouVX5op5/LT41n+yYM6IYsZ83Gb64gvsIAid413UyapzWcvoP9e5mt67Gih6A+ACid6smv32ZaY39JtQrXTnbMzjAjt9RSfSGo3VRdGvLEOEeYF1CPDeC1WAk9WpEv2+yr6wag9Q60HsVfyBILqM0Kx0dcczeI6GScD2MJUNRg7pzjBWAafPE69WXYa47lyQTUBAUB
        EOT -> null
      - public_key_pem          = <<-EOT
            -----BEGIN PUBLIC KEY-----
            MIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEA30h5tAeGPF4Zj+1j3RLh
            DT1I5wJpmU1E9VcLuXCCIGHImcj/22Vm3Xxn3ZkoyLmnzcDrDejV4DYG/u2Y6PSu
            WkLcOIH2/jmW+R6rhXvsyOwBbSW0i2dqMGc1dICjpbANXltFw0wpz/D0MooqLlV+
            aKefy0+NZ/smDOiGLGfNxm+uIL7CAIneNd1Mmqc1nL6D/XuZreuxooegPgAonerJ
            r99mWmN/SbUK1052zM4wI7fUUn0hqN1UXRryxDhHmBdQjw3gtVgJPVqRL9vsq+sG
            oPUOtB7FX8gSC6jNCsdHXHM3iOhknA9jCVDUYO6c4wVgGnzxOvVl2GuO5ckE1AQF
            AQIDAQAB
            -----END PUBLIC KEY-----
        EOT -> null
      - resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/keys/pre-des-key/versions/cc95064bcd274ef28cb3ee50667fc1b2" -> null
      - resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/keys/pre-des-key" -> null
      - tags                    = {} -> null
      - version                 = "cc95064bcd274ef28cb3ee50667fc1b2" -> null
      - versionless_id          = "https://pre-stg.vault.azure.net/keys/pre-des-key" -> null
    }

  # azurerm_key_vault_secret.POSTGRES_PASS will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_PASS" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
      + name                    = "postgresdb-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_USER will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_USER" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg"
      + name                    = "postgresdb-username"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.dtgtwy_password_secret[0] will be destroyed
  # (because azurerm_key_vault_secret.dtgtwy_password_secret is not in configuration)
  - resource "azurerm_key_vault_secret" "dtgtwy_password_secret" {
      - content_type            = "" -> null
      - id                      = "https://pre-stg.vault.azure.net/secrets/Dtgtwy0-password/9a4c15f25a9d4ba4bcfebb35351745a8" -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> null
      - name                    = "Dtgtwy0-password" -> null
      - resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/Dtgtwy0-password/versions/9a4c15f25a9d4ba4bcfebb35351745a8" -> null
      - resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/Dtgtwy0-password" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "9a4c15f25a9d4ba4bcfebb35351745a8" -> null
      - versionless_id          = "https://pre-stg.vault.azure.net/secrets/Dtgtwy0-password" -> null
    }

  # azurerm_key_vault_secret.dtgtwy_password_secret[1] will be destroyed
  # (because azurerm_key_vault_secret.dtgtwy_password_secret is not in configuration)
  - resource "azurerm_key_vault_secret" "dtgtwy_password_secret" {
      - content_type            = "" -> null
      - id                      = "https://pre-stg.vault.azure.net/secrets/Dtgtwy1-password/5fe6246a1e2b4f48b3c280c2e56d1e9a" -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> null
      - name                    = "Dtgtwy1-password" -> null
      - resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/Dtgtwy1-password/versions/5fe6246a1e2b4f48b3c280c2e56d1e9a" -> null
      - resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/Dtgtwy1-password" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "5fe6246a1e2b4f48b3c280c2e56d1e9a" -> null
      - versionless_id          = "https://pre-stg.vault.azure.net/secrets/Dtgtwy1-password" -> null
    }

  # azurerm_key_vault_secret.dtgtwy_username_secret[0] will be destroyed
  # (because azurerm_key_vault_secret.dtgtwy_username_secret is not in configuration)
  - resource "azurerm_key_vault_secret" "dtgtwy_username_secret" {
      - id                      = "https://pre-stg.vault.azure.net/secrets/Dtgtwy0-username/69c4de652a4c47d3a76b7edd7d6c52a1" -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> null
      - name                    = "Dtgtwy0-username" -> null
      - resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/Dtgtwy0-username/versions/69c4de652a4c47d3a76b7edd7d6c52a1" -> null
      - resource_versionless_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg/secrets/Dtgtwy0-username" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "69c4de652a4c47d3a76b7edd7d6c52a1" -> null
      - versionless_id          = "https://pre-stg.vault.azure.net/secrets/Dtgtwy0-username" -> null
    }

  # azurerm_key_vault_secret.dtgtwy_username_secret[1] will be destroyed
  # (because azurerm_key_vault_secret.dtgtwy_username_secret is not in configuration)
  - resource "azurerm_key_vault_secret" "dtgtwy_username_secret" {
      - id                      = "https://pre-stg.vault.azure.net/secrets/Dtgtwy1-username/bccd62b906c34ccab53905371551ee53" -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> null
      - name                    = "Dtgtwy1-username" -> null
      - resource_id             = "/subscriptions/74dacd4f-a248-45bb-a2

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

ter apply)
      - secure_boot_enabled           = false -> null
      - source_image_id               = "" -> null
      ~ tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
      - timezone                      = "" -> null
      - user_data                     = "" -> null
      ~ virtual_machine_id            = "33e396cc-a187-4403-8f88-5c9a32a9d029" -> (known after apply)
      - virtual_machine_scale_set_id  = "" -> null
      - vtpm_enabled                  = false -> null
        # (18 unchanged attributes hidden)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      ~ os_disk {
          ~ disk_size_gb              = 127 -> (known after apply)
          ~ name                      = "edit-vm1-stg_OsDisk_1_4f5c6f73fbd4483d8537af733ec7460a" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

      + termination_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }

        # (1 unchanged block hidden)
    }

  # module.finalsa_storage_account.azurerm_private_endpoint.this[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/privateEndpoints/prefinalsastg"
        name                     = "prefinalsastg"
      ~ tags                     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.finalsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/prefinalsastg"
        name                              = "prefinalsastg"
      ~ tags                              = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (38 unchanged attributes hidden)

      ~ network_rules {
          ~ virtual_network_subnet_ids = [
              - "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/ss-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/ss-ptl-vnet/subnets/iaas",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-datagateway-snet-stg",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-privatendpt-snet-stg",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-videoeditvm-snet-stg",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.finalsa_storage_account_backup.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg-backup/providers/Microsoft.Storage/storageAccounts/prefinalsabackupstg"
        name                              = "prefinalsabackupstg"
      ~ tags                              = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (37 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.ingestsa_storage_account.azurerm_private_endpoint.this[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/privateEndpoints/preingestsastg"
        name                     = "preingestsastg"
      ~ tags                     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ingestsa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/preingestsastg"
        name                              = "preingestsastg"
      ~ tags                              = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (38 unchanged attributes hidden)

      ~ network_rules {
          ~ virtual_network_subnet_ids = [
              - "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/ss-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/ss-ptl-vnet/subnets/iaas",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-datagateway-snet-stg",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-privatendpt-snet-stg",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/virtualNetworks/pre-vnet01-stg/subnets/pre-videoeditvm-snet-stg",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.ingestsa_storage_account_backup.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg-backup/providers/Microsoft.Storage/storageAccounts/preingestsabackupstg"
        name                              = "preingestsabackupstg"
      ~ tags                              = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (37 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be destroyed
  # (because azurerm_monitor_diagnostic_setting.kv-ds is not in configuration)
  - resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
      - id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg|pre-stg" -> null
      - log_analytics_workspace_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod" -> null
      - name                       = "pre-stg" -> null
      - target_resource_id         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-stg" -> null

      - enabled_log {
          - category = "AuditEvent" -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

  # module.powerBI_data_gateway[0].azurerm_managed_disk.managed_disks["datadisk1"] will be updated in-place
  ~ resource "azurerm_managed_disk" "managed_disks" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/disks/powerbi-dg1-data-stg"
        name                          = "powerbi-dg1-data-stg"
      ~ tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.powerBI_data_gateway[0].azurerm_network_interface.vm_nic will be updated in-place
  ~ resource "azurerm_network_interface" "vm_nic" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/networkInterfaces/powerbi-dg1-nic-stg"
        name                          = "powerbi-dg1-nic-stg"
      ~ tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.powerBI_data_gateway[0].azurerm_virtual_machine_extension.vmextension[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "vmextension" {
        id                          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/powerbi-1-stg/extensions/azure-disk-encrypt-9HCQ"
        name                        = "azure-disk-encrypt-9HCQ"
      ~ tags                        = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.powerBI_data_gateway[0].azurerm_windows_virtual_machine.winvm[0] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "winvm" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/powerbi-1-stg"
        name                          = "powerbi-1-stg"
      ~ tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (38 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.powerBI_data_gateway[1].azurerm_managed_disk.managed_disks["datadisk1"] will be updated in-place
  ~ resource "azurerm_managed_disk" "managed_disks" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/disks/powerbi-dg2-data-stg"
        name                          = "powerbi-dg2-data-stg"
      ~ tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.powerBI_data_gateway[1].azurerm_network_interface.vm_nic will be updated in-place
  ~ resource "azurerm_network_interface" "vm_nic" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/networkInterfaces/powerbi-dg2-nic-stg"
        name                          = "powerbi-dg2-nic-stg"
      ~ tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.powerBI_data_gateway[1].azurerm_virtual_machine_extension.vmextension[0] will be updated in-place
  ~ resource "azurerm_virtual_machine_extension" "vmextension" {
        id                          = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/powerbi-2-stg/extensions/azure-disk-encrypt-gMLX"
        name                        = "azure-disk-encrypt-gMLX"
      ~ tags                        = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.powerBI_data_gateway[1].azurerm_windows_virtual_machine.winvm[0] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "winvm" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Compute/virtualMachines/powerbi-2-stg"
        name                          = "powerbi-2-stg"
      ~ tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (38 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sa_storage_account.azurerm_private_endpoint.this[0] will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Network/privateEndpoints/presastg"
        name                     = "presastg"
      ~ tags                     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sa_storage_account.azurerm_role_assignment.storage-account-role-assignment["Storage Blob Data Contributor"] will be created
  + resource "azurerm_role_assignment" "storage-account-role-assignment" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "2008e85a-5f57-4a54-870e-abbacd6b4d09"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/presastg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.sa_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.Storage/storageAccounts/presastg"
        name                              = "presastg"
      ~ tags                              = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (38 unchanged attributes hidden)

      ~ network_rules {
            # (4 unchanged attributes hidden)

          - private_link_access {
              - endpoint_resource_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/providers/Microsoft.Security/datascanners/storageDataScanner" -> null
              - endpoint_tenant_id   = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sa_storage_account_backup.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg-backup/providers/Microsoft.Storage/storageAccounts/presabackupstg"
        name                              = "presabackupstg"
      ~ tags                              = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git" -> null
          + "builtFrom"           = "https://github.com/HMCTS/pre-shared-infrastructure.git"
          - "changeUrl"           = "" -> null
            # (5 unchanged elements hidden)
        }
        # (37 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 11 to add, 33 to change, 56 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":603,"Program":"tfcmt","SHA1":"","Vars":{}} -->